NAMKHANH145/PROJECT1/sdkconfig.defaults
# Target Config
CONFIG_IDF_TARGET="esp32s3"

# Flash Size Configuration (4MB for FH4)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# PSRAM Configuration (CRITICAL FIX FOR FH4R2)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y  # Changed from OCT to QUAD for R2 chip
# CONFIG_SPIRAM_MODE_OCT is NOT supported on R2
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS Timer
CONFIG_FREERTOS_HZ=1000

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Log Level
CONFIG_LOG_DEFAULT_LEVEL=3